namespace classes
{
Class: Engine (/Script/Engine.Engine)
-----------------------------------
TinyFont | 0x30
TinyFontName | 0x38
SmallFont | 0x50
SmallFontName | 0x58
MediumFont | 0x70
MediumFontName | 0x78
LargeFont | 0x90
LargeFontName | 0x98
SubtitleFont | 0xB0
SubtitleFontName | 0xB8
AdditionalFonts | 0xD0
AdditionalFontNames | 0xE0
ConsoleClass | 0xF0
ConsoleClassName | 0xF8
GameViewportClientClass | 0x110
GameViewportClientClassName | 0x118
LocalPlayerClass | 0x130
LocalPlayerClassName | 0x138
WorldSettingsClass | 0x150
WorldSettingsClassName | 0x158
NavigationSystemClassName | 0x170
NavigationSystemClass | 0x188
NavigationSystemConfigClassName | 0x190
NavigationSystemConfigClass | 0x1A8
AvoidanceManagerClassName | 0x1B0
AvoidanceManagerClass | 0x1C8
AIControllerClassName | 0x1D0
PhysicsCollisionHandlerClass | 0x1E8
PhysicsCollisionHandlerClassName | 0x1F0
GameUserSettingsClassName | 0x208
GameUserSettingsClass | 0x220
GameUserSettings | 0x228
LevelScriptActorClass | 0x230
LevelScriptActorClassName | 0x238
DefaultBlueprintBaseClassName | 0x250
GameSingletonClassName | 0x268
GameSingleton | 0x280
AssetManagerClassName | 0x288
AssetManager | 0x2A0
DefaultTexture | 0x2A8
DefaultTextureName | 0x2B0
DefaultDiffuseTexture | 0x2C8
DefaultDiffuseTextureName | 0x2D0
DefaultBSPVertexTexture | 0x2E8
DefaultBSPVertexTextureName | 0x2F0
HighFrequencyNoiseTexture | 0x308
HighFrequencyNoiseTextureName | 0x310

CharacterHealthDamagePostPrcessEffectsComponent | 0x7C8
AnimStateUpdaterComponent_3P | 0x7D0
AnimStateUpdaterComponent_1P | 0x7D8
CharacterAimingPostProcessComponent | 0x7E0
SpeakerComponentClass | 0x7E8
CharacterAudioComponentClass | 0x7F8
CustomizationComponent | 0x808
MaterialManagerComponent | 0x810
ImpactRenderComponent | 0x818
InteractorComponent | 0x820
AimComponent | 0x828
ZoomingComponent | 0x830
InventoryComponent | 0x838
XpComponent | 0x840
InputModifierComponent | 0x848
ThermalHeatComponent | 0x850
SquadComponent | 0x858
SingleBulletReloadLoopComponent | 0x860
PredictiveMovementDebug | 0x868
CameraManagerComponent | 0x870
SlideMovementComponent | 0x878
LadderMovementComponent | 0x880
TraversalComponent | 0x888
GravityGunActor | 0x890
ActorAudioDataComponent | 0x898
OcclusionPointsComponent | 0x8A0
AnimationDataComponent | 0x8A8
SpawnEffectsComponent | 0x8B0
InvulnerabilityComponent | 0x8B8
ManagedPawnComponent | 0x8C0
CombatContributionComponent | 0x8C8
InGameEmoteComponent | 0x8D0
AnimPropManagerComponent | 0x8D8
FirePropagationCharacterComponent | 0x8E0
SprayManagerComponent | 0x8E8
EmoticonManagerComponent | 0x8F0
HandGestureManagerComponent | 0x8F8
ActionWheelManagerComponent | 0x900
CharacterSoundEffectManagerComponent | 0x908
ItemRadialWheelComponent | 0x910
CharacterPostProcessComponent | 0x918
BoundsRestrictingComponent | 0x920
HealTargetWorldIconComponent | 0x928
Archetype | 0x930
bIsColliding | 0x938
RepAimPitch | 0x93A
DrasticTurnAnimationCounter | 0x948
PlayerReviveEffect | 0x960
DeadStatus | 0x968
OnPlayerInteractPressed | 0x9E8
OnCharacterComponentsInitialized | 0x9F8
OnAbilitySystemInitialized | 0xA08
OnApplyGameplayCue | 0xA18
OnRemoveGameplayCue | 0xA28
OnInitializedFromPlayerState | 0xA38
CollisionGamePlayCue | 0xA48
bUseCustomFirstPersonAnimSequence | 0xAA8
CurrentCustomFirstPersonAnimSequence | 0xAB0
bIsAnyMontageActive | 0xAB8
OnPredictedMoveCollision | 0x1CA0
OnModifyInputVector | 0x1CC0
RootMotionComponent | 0x1CD0
OnArchetypeChanged | 0x1CD8

Class: EmbarkCharacterBase (/Script/EmbarkCharacter.EmbarkCharacterBase)
-----------------------------------
AbilitySystem | 0x678
StateInterpolatorComponent | 0x680
PossessionEventComponent | 0x688
EmbarkMesh | 0x690
EmbarkCharacterMovement | 0x698
bInfiniteAmmo | 0x6A0
OnPlayerStateReplicated | 0x6A8
bDisableWhenOutOfBounds | 0x6B8
CachedController | 0x6D0

Class: DiscoveryCharacterMovementComponent (/Script/DiscoveryGameplay.DiscoveryCharacterMovementComponent)
-----------------------------------
CachedFloorComponentStartPhysics | 0x1E88
DiscoMovementStartPhysicsTickFunction_Server | 0x1EB8
DiscoMovementPostPhysicsTickFunction_Server | 0x1EE8
FloorComponent | 0x1F18
FloorBoneName | 0x1F20
ReplicatedMovementBaseState | 0x1F30
FloorPhysMaterial | 0x22E0
DiscoveryCharacterOwner | 0x22E8
MovementSettings | 0x22F0
}

namespace sdks
{
// ASClass Angelscript.DiscoveryCharacter
// Size: 0x1d10 (Inherited: 0x710)
	struct ADiscoveryCharacter : ADiscoveryCharacterBase {
	struct UCapsuleComponent* PhysicsColliderCapsuleComponent; // 0x710(0x08)
	char pad_718[0x28]; // 0x718(0x28)
	struct UEmbarkSkeletalMeshComponent* FirstPersonMesh; // 0x740(0x08)
	struct UParticleProxyMeshComponent* ParticleProxyMeshComponent; // 0x748(0x08)
	struct UDiscoveryFollowCameraComponent* FollowCamera; // 0x750(0x08)
	struct USoftClampLookDirComponent* SoftClampLookDirComponent; // 0x758(0x08)
	struct UDiscoveryObstacleProbeComponent* ObstacleProbeComponent; // 0x760(0x08)
	struct UClientPredictiveMovementComponent* PredictiveMovementComponent; // 0x768(0x08)
	float ReplicatedMaxSpeed; // 0x770(0x04)
	char pad_774[0x4]; // 0x774(0x04)
	struct UInputCharacterMovementStackComponent* InputCharacterMovementStack; // 0x778(0x08)
	struct UDiscoveryWorldIconComponent* WorldIconComponent; // 0x780(0x08)
	struct UDiscoveryWorldIconComponent* EnemyPingWorldIconComponent; // 0x788(0x08)
	struct UClientCloakingComponent* CloakingComponent; // 0x790(0x08)
	struct UDiscoveryZiplineCharacterProxyComponent* ZiplineProxyComponent; // 0x798(0x08)
	struct UPlayerVisionGadgetComponent* VisionGadgetComponent; // 0x7a0(0x08)
	struct UAnimEventManagerComponent* AnimEventManager; // 0x7a8(0x08)
	struct UDiscoveryInputAbilityHelperComponent* InputAbilityHelperComponent; // 0x7b0(0x08)
	struct UDiscoveryPingInfoComponent* PingInfoComponent; // 0x7b8(0x08)
	struct UDiscoveryGroundedHistoryComponent* GroundedHistoryComponent; // 0x7c0(0x08)
	struct UInputComponent* InputComponent; // 0x7c8(0x08)
	struct UDiscoveryCharacterHealthComponent* HealthComponent; // 0x7d0(0x08)
	struct UCharacterHealthDamagePostProcessEffectsComponent* CharacterHealthDamagePostPrcessEffectsComponent; // 0x7d8(0x08)
	struct UDiscoveryAnimStateUpdaterComponent* AnimStateUpdaterComponent_3P; // 0x7e0(0x08)
	struct UDiscoveryAnimStateUpdaterComponent* AnimStateUpdaterComponent_1P; // 0x7e8(0x08)
	struct UCharacterAimingPostProcessComponent* CharacterAimingPostProcessComponent; // 0x7f0(0x08)
	struct UDiscoveryPlayerSpeakerComponent* SpeakerComponentClass; // 0x7f8(0x08)
	char pad_800[0x8]; // 0x800(0x08)
	struct UDiscoveryCharacterAudioComponent* CharacterAudioComponentClass; // 0x808(0x08)
	char pad_810[0x8]; // 0x810(0x08)
	struct UCharacterCustomizationComponent* CustomizationComponent; // 0x818(0x08)
	struct UMaterialManagerComponent* MaterialManagerComponent; // 0x820(0x08)
	struct UCharacterImpactRenderComponent* ImpactRenderComponent; // 0x828(0x08)
	struct UDiscoveryInteractorComponent* InteractorComponent; // 0x830(0x08)
	struct UAimComponent* AimComponent; // 0x838(0x08)
	struct UZoomingComponent* ZoomingComponent; // 0x840(0x08)
	struct UDiscoveryInventoryComponent* InventoryComponent; // 0x848(0x08)
	struct UDiscoveryOnlinePlayerXpActorComponent* XpComponent; // 0x850(0x08)
	struct UDiscoveryInputModifierComponent* InputModifierComponent; // 0x858(0x08)
	struct UThermalHeatComponent* ThermalHeatComponent; // 0x860(0x08)
	struct USquadComponent* SquadComponent; // 0x868(0x08)
	struct USingleBulletReloadLoopComponent* SingleBulletReloadLoopComponent; // 0x870(0x08)
	struct UPredictiveMovementDebugComponent* PredictiveMovementDebug; // 0x878(0x08)
	struct UDiscoveryCameraManagerComponent* CameraManagerComponent; // 0x880(0x08)
	struct UCharacterSlideComponent* SlideMovementComponent; // 0x888(0x08)
	struct ULadderMovementComponent* LadderMovementComponent; // 0x890(0x08)
	struct UCharacterTraversalComponent* TraversalComponent; // 0x898(0x08)
	struct AGravityGunActor* GravityGunActor; // 0x8a0(0x08)
	struct UActorAudioDataComponent* ActorAudioDataComponent; // 0x8a8(0x08)
	struct UDiscoveryOcclusionPointsComponent_PlayerCharacter* OcclusionPointsComponent; // 0x8b0(0x08)
	struct UCharacterAnimationDataComponent* AnimationDataComponent; // 0x8b8(0x08)
	struct UDiscoverySpawnEffectDissolveComponent* SpawnEffectsComponent; // 0x8c0(0x08)
	struct UDiscoveryInvulnerabilityComponent* InvulnerabilityComponent; // 0x8c8(0x08)
	struct UDiscoveryManagedPawnComponent* ManagedPawnComponent; // 0x8d0(0x08)
	struct UPlayerCombatContributionComponent* CombatContributionComponent; // 0x8d8(0x08)
	struct UCharacterInGameEmoteComponent* InGameEmoteComponent; // 0x8e0(0x08)
	struct UAnimPropManagerComponent* AnimPropManagerComponent; // 0x8e8(0x08)
	struct UDiscoveryFirePropagationCharacterComponent* FirePropagationCharacterComponent; // 0x8f0(0x08)
	struct USprayManagerComponent* SprayManagerComponent; // 0x8f8(0x08)
	struct UEmoticonManagerComponent* EmoticonManagerComponent; // 0x900(0x08)
	struct UHandGestureManagerComponent* HandGestureManagerComponent; // 0x908(0x08)
	struct UActionWheelManagerComponent* ActionWheelManagerComponent; // 0x910(0x08)
	struct UCharacterSoundEffectManagerComponent* CharacterSoundEffectManagerComponent; // 0x918(0x08)
	struct UDiscoveryItemRadialWheelComponent* ItemRadialWheelComponent; // 0x920(0x08)
	struct UCharacterPostProcessComponent* CharacterPostProcessComponent; // 0x928(0x08)
	struct UDiscoveryMapBoundsRestrictedActorComponent* BoundsRestrictingComponent; // 0x930(0x08)
	struct UDiscoveryWorldIconComponent* HealTargetWorldIconComponent; // 0x938(0x08)
	struct UCharacterArchetypeDataAsset* Archetype; // 0x940(0x08)
	bool bIsColliding; // 0x948(0x01)
	char pad_949[0x1]; // 0x949(0x01)
	int16_t RepAimPitch; // 0x94a(0x02)
	char pad_94C[0xc]; // 0x94c(0x0c)
	int32_t DrasticTurnAnimationCounter; // 0x958(0x04)
	char pad_95C[0x14]; // 0x95c(0x14)
	struct UEffectDataAsset* PlayerReviveEffect; // 0x970(0x08)
	struct UGameplayEffect* DeadStatus; // 0x978(0x08)
	char pad_980[0x78]; // 0x980(0x78)
	struct FMulticastInlineDelegate OnPlayerInteractPressed; // 0x9f8(0x10)
	struct FMulticastInlineDelegate OnCharacterComponentsInitialized; // 0xa08(0x10)
	struct FMulticastInlineDelegate OnAbilitySystemInitialized; // 0xa18(0x10)
	struct FMulticastInlineDelegate OnApplyGameplayCue; // 0xa28(0x10)
	struct FMulticastInlineDelegate OnRemoveGameplayCue; // 0xa38(0x10)
	struct FMulticastInlineDelegate OnInitializedFromPlayerState; // 0xa48(0x10)
	struct FGameplayTag CollisionGamePlayCue; // 0xa58(0x08)
	char pad_A60[0x58]; // 0xa60(0x58)
	bool bUseCustomFirstPersonAnimSequence; // 0xab8(0x01)
	char pad_AB9[0x7]; // 0xab9(0x07)
	struct UAnimSequence* CurrentCustomFirstPersonAnimSequence; // 0xac0(0x08)
	bool bIsAnyMontageActive; // 0xac8(0x01)
	char pad_AC9[0x11e7]; // 0xac9(0x11e7)
	struct FMulticastInlineDelegate OnPredictedMoveCollision; // 0x1cb0(0x10)
	char pad_1CC0[0x10]; // 0x1cc0(0x10)
	struct FMulticastInlineDelegate OnModifyInputVector; // 0x1cd0(0x10)
	struct URootMotionComponent* RootMotionComponent; // 0x1ce0(0x08)
	struct FMulticastInlineDelegate OnArchetypeChanged; // 0x1ce8(0x10)
	char pad_1CF8[0x18]; // 0x1cf8(0x18)
 
	void OnPredictedMoveCharacterCollision(struct UPrimitiveComponent* None, struct AActor* None, struct UPrimitiveComponent* None, struct FVector None, struct FHitResult& None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnPredictedMoveCharacterCollision // (HasOutParms) // @ game+0xffff8009802b0000
	void OnWeatherChanged_Client(struct ADiscoveryWeatherManager* None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnWeatherChanged_Client // () // @ game+0xffff8009802b0000
	void StateInterpolatorPreUpdateInputForOwner_Client(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.StateInterpolatorPreUpdateInputForOwner_Client // () // @ game+0xffff8009802b0000
	void OnCollision(struct UPrimitiveComponent* None, struct AActor* None, struct UPrimitiveComponent* None, struct FVector None, struct FHitResult& None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnCollision // (HasOutParms) // @ game+0xffff8009802b0000
	void OnAttributeChanged(struct FAngelscriptModifiedAttribute& None); // ASFunction_ReferenceArg Angelscript.DiscoveryCharacter.OnAttributeChanged // (HasOutParms) // @ game+0xffff8009802b0000
	void RegisterAttributeCallbacks(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.RegisterAttributeCallbacks // () // @ game+0xffff8009802b0000
	void Client_OnAbilityRecovered(struct FGameplayTag None); // ASFunction_ReferenceArg Angelscript.DiscoveryCharacter.Client_OnAbilityRecovered // (Net|NetClient) // @ game+0xffff8009802b0000
	void OnAbilityRecovered_Server(struct FGameplayTag None); // ASFunction_ReferenceArg Angelscript.DiscoveryCharacter.OnAbilityRecovered_Server // () // @ game+0xffff8009802b0000
	void OnHiddenTagChanged(struct FGameplayTag None, int32_t None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnHiddenTagChanged // () // @ game+0xffff8009802b0000
	void OnLanded(struct FHitResult& Hit); // ASFunction_ReferenceArg Angelscript.DiscoveryCharacter.OnLanded // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xffff8009802b0000
	struct FVector GetPawnViewLocationBP(); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.GetPawnViewLocationBP // (Event|Protected|BlueprintEvent|Const) // @ game+0xffff8009802b0000
	struct FVector GetShootLocation(); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.GetShootLocation // (Event|Public|BlueprintEvent|Const) // @ game+0xffff8009802b0000
	void K2_OnEndViewTarget(struct APlayerController* PC); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.K2_OnEndViewTarget // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.K2_OnBecomeViewTarget // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void OnToggleThirdPersonPressed(struct FKey None); // ASFunction_ReferenceArg Angelscript.DiscoveryCharacter.OnToggleThirdPersonPressed // (BlueprintCallable) // @ game+0xffff8009802b0000
	void ReceiveSetupPlayerInputComponent(struct UInputComponent* PlayerInputComponent); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.ReceiveSetupPlayerInputComponent // (Event|Protected|BlueprintEvent) // @ game+0xffff8009802b0000
	void OnPlayerDied(struct UHealthComponent* None, struct FInstigator None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnPlayerDied // (BlueprintCallable) // @ game+0xffff8009802b0000
	void OnRep_RepAimPitch(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.OnRep_RepAimPitch // () // @ game+0xffff8009802b0000
	void OnRep_ArchetypeChanged(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.OnRep_ArchetypeChanged // (BlueprintCallable) // @ game+0xffff8009802b0000
	void BlueprintRecalculateBaseEyeHeight(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.BlueprintRecalculateBaseEyeHeight // (Event|Protected|BlueprintEvent) // @ game+0xffff8009802b0000
	void OnEquippedItemChanged(struct AItem* None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnEquippedItemChanged // (BlueprintCallable) // @ game+0xffff8009802b0000
	bool IsWalking(); // ASFunction_ByteReturn Angelscript.DiscoveryCharacter.IsWalking // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
	double GetCameraFov(); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.GetCameraFov // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
	bool IsAiming(); // ASFunction_ByteReturn Angelscript.DiscoveryCharacter.IsAiming // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
	bool IsSprinting(); // ASFunction_ByteReturn Angelscript.DiscoveryCharacter.IsSprinting // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
	bool BlueprintSimulatePhysCustom(struct FEmbarkMovementParamsDynamic& Dynamics, struct FEmbarkMovementParamsStatic& Statics); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.BlueprintSimulatePhysCustom // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8009802b0000
	void BlueprintSimulatePhysFalling(struct FEmbarkMovementParamsDynamic& Dynamics, struct FEmbarkMovementParamsStatic& Statics); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.BlueprintSimulatePhysFalling // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8009802b0000
	void BlueprintSimulatePhysWalking(struct FEmbarkMovementParamsDynamic& Dynamics, struct FEmbarkMovementParamsStatic& Statics); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.BlueprintSimulatePhysWalking // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8009802b0000
	void BlueprintSimulatePhysFlying(struct FEmbarkMovementParamsDynamic& Dynamics, struct FEmbarkMovementParamsStatic& Statics); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.BlueprintSimulatePhysFlying // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8009802b0000
	void BlueprintSimulateRootMotion(struct FCharacterMovementRootWarpContext& RootWarpContext, struct FVector& OutNewDeltaMove, struct FTransform& OutRootWarpTransformDeltaMove); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.BlueprintSimulateRootMotion // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8009802b0000
	void BlueprintGetDeltaMoveFromMovingFloor(struct FVector& ProposedMoveDelta, float DeltaSeconds, struct FVector& SafeMoveDelta); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.BlueprintGetDeltaMoveFromMovingFloor // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8009802b0000
	float BlueprintGetStandingCapsuleHalfHeight(); // ASFunction_FloatExtendedToDoubleReturn Angelscript.DiscoveryCharacter.BlueprintGetStandingCapsuleHalfHeight // (Event|Public|BlueprintEvent|Const) // @ game+0xffff8009802b0000
	float BlueprintGetCrouchingCapsuleHalfHeight(); // ASFunction_FloatExtendedToDoubleReturn Angelscript.DiscoveryCharacter.BlueprintGetCrouchingCapsuleHalfHeight // (Event|Public|BlueprintEvent|Const) // @ game+0xffff8009802b0000
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // ASFunction_ByteArg Angelscript.DiscoveryCharacter.ReceiveEndPlay // (Event|Protected|BlueprintEvent) // @ game+0xffff8009802b0000
	void ReceivePostInitializeComponents(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.ReceivePostInitializeComponents // (Event|Protected|BlueprintEvent) // @ game+0xffff8009802b0000
	void OnSelectedPackChanged_Client(struct ADiscoveryPlayerState* None, struct FContestantPack None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnSelectedPackChanged_Client // () // @ game+0xffff8009802b0000
	void OnSelectedPackChanged_Server(struct ADiscoveryPlayerState* None, struct FContestantPack None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnSelectedPackChanged_Server // () // @ game+0xffff8009802b0000
	void ReceiveOnRep_Controller(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.ReceiveOnRep_Controller // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void ReceiveOnRep_PlayerState(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.ReceiveOnRep_PlayerState // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void BP_OutsideWorldBoundsEvent(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.BP_OutsideWorldBoundsEvent // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void BP_FellOutOfWorldEvent(struct UDamageType* DmgType); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.BP_FellOutOfWorldEvent // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void ReceiveEmbarkOnUnPossessed(struct AController* InController); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.ReceiveEmbarkOnUnPossessed // (Event|Protected|BlueprintEvent) // @ game+0xffff8009802b0000
	void ReceiveEmbarkOnPossessed(struct AController* InController); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.ReceiveEmbarkOnPossessed // (Event|Protected|BlueprintEvent) // @ game+0xffff8009802b0000
	void OnPredictedMovementUpdated_Client(struct UClientPredictiveMovementComponent* None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnPredictedMovementUpdated_Client // () // @ game+0xffff8009802b0000
	void ReceiveTick(float DeltaSeconds); // ASFunction_FloatExtendedToDoubleArg Angelscript.DiscoveryCharacter.ReceiveTick // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void Client_LogRedOnCollisionModeViolation(enum class ECollisionEnabled None, struct FName None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.Client_LogRedOnCollisionModeViolation // (Net|NetReliableNetClient|BlueprintCallable) // @ game+0xffff8009802b0000
	void SendTelemetryPlayerNetworkLatency_Server(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.SendTelemetryPlayerNetworkLatency_Server // () // @ game+0xffff8009802b0000
	void SendTelemetryPlayerPosition_Server(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.SendTelemetryPlayerPosition_Server // () // @ game+0xffff8009802b0000
	void OnRep_OnGravityGunActor(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.OnRep_OnGravityGunActor // () // @ game+0xffff8009802b0000
	void OnDespawnFadeDone(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.OnDespawnFadeDone // () // @ game+0xffff8009802b0000
	void OnCharacterActivationChanged(struct AController* None, struct APawn* None, bool None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacter.OnCharacterActivationChanged // () // @ game+0xffff8009802b0000
	void ShowCharacter_Client(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.ShowCharacter_Client // () // @ game+0xffff8009802b0000
	void HideCharacter_Client(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.HideCharacter_Client // () // @ game+0xffff8009802b0000
	void CharacterMovementSystemPostUpdate(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.CharacterMovementSystemPostUpdate // () // @ game+0xffff8009802b0000
	void AdjustPingInformation(struct FPing& None); // ASFunction_ReferenceArg Angelscript.DiscoveryCharacter.AdjustPingInformation // (HasOutParms) // @ game+0xffff8009802b0000
	void OnCustomizationUpdated(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.OnCustomizationUpdated // () // @ game+0xffff8009802b0000
	void ReceiveBeginPlay(); // ASFunction_NoParams Angelscript.DiscoveryCharacter.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0xffff8009802b0000
};
 
// ASClass Angelscript.SquadComponent
// Size: 0xe0 (Inherited: 0xb8)
struct USquadComponent : UActorComponent {
	int32_t SquadIndex; // 0xb8(0x04)
	int32_t PlayerIndexInSquad; // 0xbc(0x04)
	struct FMulticastInlineDelegate OnSquadIndexChanged; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnPlayerIndexInSquadChanged; // 0xd0(0x10)
 
	int32_t GetPlayerIndexInSquad(); // ASFunction_DWordReturn Angelscript.SquadComponent.GetPlayerIndexInSquad // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
	int32_t GetSquadIndex(); // ASFunction_DWordReturn Angelscript.SquadComponent.GetSquadIndex // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
	void SetPlayerIndexInSquad_Server(int32_t None); // ASFunction_DWordArg Angelscript.SquadComponent.SetPlayerIndexInSquad_Server // (BlueprintCallable) // @ game+0xffff8009802b0000
	void SetSquadIndex(int32_t None); // ASFunction_DWordArg Angelscript.SquadComponent.SetSquadIndex // (BlueprintCallable) // @ game+0xffff8009802b0000
	void OnRep_PlayerIndexInSquad(); // ASFunction_NoParams Angelscript.SquadComponent.OnRep_PlayerIndexInSquad // () // @ game+0xffff8009802b0000
	void OnRep_SquadIndexChanged(); // ASFunction_NoParams Angelscript.SquadComponent.OnRep_SquadIndexChanged // () // @ game+0xffff8009802b0000
};
 
// ASClass Angelscript.DiscoveryCharacterHealthComponent
// Size: 0x840 (Inherited: 0x598)
struct UDiscoveryCharacterHealthComponent : UDiscoveryHealthComponent {
	struct FDiscoveryCoinDeathHandler CoinDeathHandler; // 0x598(0x290)
	char pad_828[0x18]; // 0x828(0x18)
 
	void CoinDeathTick_Client(double None); // ASFunction_DoubleArg Angelscript.DiscoveryCharacterHealthComponent.CoinDeathTick_Client // () // @ game+0xffff8009802b0000
	void OnTagChanged_CharacterStateDead(struct FGameplayTag& None, int32_t None); // ASFunction_NotThreadSafe Angelscript.DiscoveryCharacterHealthComponent.OnTagChanged_CharacterStateDead // (HasOutParms) // @ game+0xffff8009802b0000
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // ASFunction_ByteArg Angelscript.DiscoveryCharacterHealthComponent.ReceiveEndPlay // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	void ReceiveBeginPlay(); // ASFunction_NoParams Angelscript.DiscoveryCharacterHealthComponent.ReceiveBeginPlay // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
};
 
// ASClass Angelscript.DiscoveryHealthComponent
// Size: 0x598 (Inherited: 0x598)
struct UDiscoveryHealthComponent : UHealthComponent {
};
 
// ASClass Angelscript.HealthComponent
// Size: 0x598 (Inherited: 0xb8)
struct UHealthComponent : UHealthComponentInterface {
	bool bCanTakeDamage; // 0xb8(0x01)
	bool bDontApplyDamageToHealth; // 0xb9(0x01)
	char pad_BA[0x6]; // 0xba(0x06)
	struct FDiscoveryDamageTakenData LastTakenDamage; // 0xc0(0x238)
	struct FSparseDiscoveryDamageTakenData SparseLastTakenDamage; // 0x2f8(0xe8)
	enum class EHealthComponentDebugVerbosity bDebugging; // 0x3e0(0x01)
	char pad_3E1[0x7]; // 0x3e1(0x07)
	struct TMap<struct FGameplayTag, double> StartingIncomingDamageMultipliers; // 0x3e8(0x50)
	bool bOverrideIncomingDamageTypes; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct FGameplayTagContainer OverridenIncomingDamageTypes; // 0x440(0x20)
	double HealthMax; // 0x460(0x08)
	bool bSpecifyStartingHealth; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	double StartingHealth; // 0x470(0x08)
	bool bFriendlyFire; // 0x478(0x01)
	bool bSelfDamage; // 0x479(0x01)
	bool bSendsMulticastOnDamage; // 0x47a(0x01)
	char pad_47B[0x5]; // 0x47b(0x05)
	double ReviveHealthPercentage; // 0x480(0x08)
	bool bRegenerateHealth; // 0x488(0x01)
	char pad_489[0x7]; // 0x489(0x07)
	double RegenerationStartDelay; // 0x490(0x08)
	double RegenerationRate; // 0x498(0x08)
	bool bExponentialRegeneration; // 0x4a0(0x01)
	char pad_4A1[0x7]; // 0x4a1(0x07)
	double RegenerationExponent; // 0x4a8(0x08)
	bool bDamageReducesRegenerationMax; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	int32_t TrackingEventBitMask; // 0x4b4(0x04)
	struct FGameplayTag HitFeedbackTargetTag; // 0x4b8(0x08)
	struct FHealthBarSegmentInfo HealthBarSegmentInfo; // 0x4c0(0x18)
	struct FMulticastInlineDelegate OnDamageTaken_Server; // 0x4d8(0x10)
	struct FMulticastInlineDelegate OnHealingReceived_Server; // 0x4e8(0x10)
	struct FMulticastInlineDelegate OnDamageTaken_OwningClient; // 0x4f8(0x10)
	struct FMulticastInlineDelegate OnDamageTaken_AllClients; // 0x508(0x10)
	struct FMulticastInlineDelegate OnHealthChanged; // 0x518(0x10)
	struct FMulticastInlineDelegate OnDamaged; // 0x528(0x10)
	struct FMulticastInlineDelegate OnDead; // 0x538(0x10)
	struct FMulticastInlineDelegate OnHealthRestored; // 0x548(0x10)
	char pad_558[0x20]; // 0x558(0x20)
	struct AController* LastDamageInstigator; // 0x578(0x08)
	char pad_580[0x18]; // 0x580(0x18)
 
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // ASFunction_ByteArg Angelscript.HealthComponent.ReceiveEndPlay // (Event|Public|BlueprintEvent) // @ game+0xffff8009802b0000
	struct FLinearColor GetHealthColor(); // ASFunction_NotThreadSafe Angelscript.HealthComponent.GetHealthColor // (BlueprintCallable) // @ game+0xffff8009802b0000
	bool IsCritical(); // ASFunction_ByteReturn Angelscript.HealthComponent.IsCritical // (BlueprintCallable|BlueprintPure) // @ game+0xffff8009802b0000
	double GetMaxRegenerationHealthPercent(); // ASFunction_NotThreadSafe Angelscript.HealthComponent.GetMaxRegenerationHealthPercent // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
	float GetMaxHealth(); // ASFunction_FloatReturn Angelscript.HealthComponent.GetMaxHealth // (BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8009802b0000
